'''
什么是面向过程？  C
1、自上而下顺序执行，步骤精确。
2、程序结构是按功能划分，功能分成若干个基本模块，这些模块按照规则组成
树状结构。
3、各个模块之间的关系尽可能简单，在功能上独立。
4、每个模块间均有顺序、选择、循环三种基本结构组成。
5、程序的流程在写程序时就已经决定了。


什么是面向对象？ Java   Python  Android  PHP
1、面向对象是相对面向过程而言的。
2、面向过程和面向对象都是程序设计的一种思想。
3、面向过程：强调的是功能，注重的是解决问题的步骤。
4、面向对象：将功能封装进对象，强调的是具备了功能的对
象，注重的是解决问题需要哪些对象。
5、面向对象要实现功能是基于面向过程的。


面向对象：
1、把数据和对数据处理的方法放在一起，作为一个相互依存的整体。
2、对同类对象的抽出其共同点，形成类。
3、类中的大多数数据，只能用本类的方法处理。
4、程序的流程是在用户使用过程中决定的。

词语定义：
类(class) ： 具有相同属性或行为的对象的集合。
对象 : 类的一个实际个体。
属性：对应的是类中成员变量。  成员变量是定义在类里面的变量。
行为：对应的是类中成员方法/函数。   成员方法是定义在类里面的方法。

实例化：创建一个类的实例对象，创建一个类的具体对象。

把大象关进冰箱：
1、面向过程思想：打开冰箱门 -> 把大象放进去 -> 关上冰箱门
2、面向对象思想：大象  冰箱  一个人   一个人打开冰箱门 -> 一个人关闭冰箱门
一个人去造了一个冰箱 -> 一个人打开冰箱门 -> 一个人把大象放进去 ->
一个人关闭冰箱门

面向过程 ：人：执行者     面向对象：人：指挥者

吃一盘西红柿炒鸡蛋：


电脑 ----> 类
我桌上的电脑 ----> 对象

人 -----> 类
我 -----> 对象

人：姓名  性别  年龄   ---> 属性
人：走路  吃饭  睡觉  处对象   ---> 行为



人类：姓名，性别 ，身份证号，吃饭
创建一个姓名为妞妞的，性别为公公的，身份证号为123，可以吃饭的人
创建一个姓名为点点的，性别为女的，身份证号为1234人
'''