"""
什么是面向过程？ C
1.自上而下顺序，步骤精确。
2、程序结是按功能划分，功能分成若干个基本模块，这些模块按照规则组成树状结构
3、各个模块之间的关系尽可能简单，在功能上独立。
4、 每个模块均有循序、选择、循环三种基本结构
5、程序的流程在写程序时，就已经决定。

什么是面向对象？ Java Python PHP
1、面向对象是相对面向过程而言的
2、面向过程和面向对象都是程序设计的一种思想
3、面向过程：强调的是功能，注重的是解决问题的步骤
4、面向对象：将功能封装进对象，强调的是具备了功能的对象，注重的是解决问题需要的对象
5、面向对象要实现是基于面向过程的。

面向对象：
1.把数据和对数据没处理的方法在一起，作为一个相互依存的整体
2.对同类对象的抽出其共同点，形成类
3、类中的大多数数据，只能用本类的方法处理。
4、程序的流程在用户使用过程中决定的

词语定义：
类（class）:具有相同属性或行为的对象集合
对象：类的一个实际个体
属性：对应的是类中的成员变量
行为：对应的是类中的成员方法


实例：初见一个类的实例对象，创建一个类具体对象


把大象关进冰箱：
1、面向过程思想：打开冰箱门 --》 把大象放进去 ---》 关门
2、面向对象思想：大象 冰箱 一个人

"""