# while  循环
# while 循环： 简化我们的代码量
'''
语法格式：
while 表达式:
    语句
表达式为boolean值
'''
# 逻辑：当程序执行到while语句时，首先判断表达式的值是否为真，为真则
# 执行while下面的语句，如果为假，跳过while语句向下继续执行程序
# 如果表达式为真，则执行语句，语句执行结束后，继续判断表达式的值，
# 直到表达式为假，该语句停止执行

# 注意：当使用while循环时，循环的语句中一定要有一条语句可以更改while
# 后面的判断条件
# 除非我们的工程需要死循环
num = 1
while num <= 5:
    print("hello")
    # 更改条件的语句
    num = num + 1

print("12345678909876543")

# num = 1  1   ==> num=2
# num = 2 2    ==> num=3
# num=3   3   ==> num=4
# num=4  4  ==> num=5
# num=5 5  ==> num=6
# num=6

# 1000  250   4
# 0

# 输出0-10
num = 0
while num <= 10:
    print(num)
    num += 1

