# 1、将一个列表中的某一个元素全部删除
# list1 = [1,1,1,3,4,6,1,4,8,0,34,2,71,2,1,1]
# 将list1中所有的元素1删除

# 两种写法

# 2、for 计算1-100的和
# 3、输出50以内能被7整除的数
# 4、给定一个字符串，判断该字符串中有多少个a   jhgfdsdtyaaawertyukjbvaa
# 5、给定一个字符串，输出字符串的下标及对应下标位置的字符



# 6、输出九九乘法
'''
1*1=1
1*2=2 2*2=4
1*3=3 2*3=6 3*3=9
'''

# 7、
'''
*
**
***
'''
'''
  *
 **
***
'''
# 8、将一个字符串中的小写字母转为大写，将大写字母转为小写，其他字符不变
# abcED123f  ----> ABCed123F
# 97 -32   +32   for  if

# 9、将字符串abcd变为字符串4567
# asc   -45
# 密码加密


# 10、随机产生一个长度为6的字符串，字符串中可能包含大写字母，小写字母或数字
# s2AHr6

